src/Catalogs/Произведения/Произведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Произведения</name>
  <predefined>
    <items>
      <name>Оповещение</name>
      <description>Оповещение</description>
    </items>
  </predefined>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСайте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаДвоичные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Слов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользоватьВПодборках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ФорматированиеТекстаСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьФайлКниги(Произведение) Экспорт
	
	Текст = Произведение;
	УдалитьВременныеФайлы(Текст);
		
	МассивСтрок 	= Текст.ТекстМассив.Получить();
	
	ИмяМакета		= "Макет";
	Макет 			= Справочники.Произведения.ПолучитьМакет(ИмяМакета);
	Книга			= Новый ТабличныйДокумент;
	ТекущаяСтраница = 1;
	
	Книга.РазмерСтраницы 			= "Quarto";
	Книга.АвтоМасштаб  				= Истина;
	 
	
	ОбластьТитульник 						= Макет.ПолучитьОбласть("Титульник");
	ОбластьТитульник.Параметры.Код 			= Текст.Код;
	ОбластьТитульник.Параметры.Наименование = Текст.Наименование;
	ОбластьТитульник.Параметры.Автор 		= Текст.Автор;
	
	ОбластьШапка 						= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Наименование = Текст.Наименование;
	ОбластьШапка.Параметры.Автор 		= Текст.Автор.Имя + " " + Текст.Автор.Фамилия;
	ОбластьШапка.Параметры.Страница		= ТекущаяСтраница;
	
	Книга.Вывести(ОбластьТитульник);
	Книга.ВывестиГоризонтальныйРазделительСтраниц();
	Книга.Вывести(ОбластьШапка);
	
	ОбластьСодержания 	= Макет.ПолучитьОбласть("Текст");
	ОбластьСокращенная	= Макет.ПолучитьОбласть("Текст");
	Страница 			= "";
	
	Для Каждого СтрокаТекста Из МассивСтрок Цикл
		
		Пробел = ?(Страница = "", "", " ");
		ОбластьСодержания.Параметры.Содержимое = Страница + Пробел + СтрокаТекста;
		ОбластьСокращенная.Параметры.Содержимое = Страница + Пробел + СокрЛП(СтрокаТекста);

		НоваяСтраница 	= Ложь;
		Вывод 			= Ложь;
		
		Если Не Книга.ПроверитьВывод(ОбластьСодержания) Тогда
			
			НоваяСтраница = Истина;
			
			Если Книга.ПроверитьВывод(ОбластьСокращенная) Тогда
				ОбластьСодержания.Параметры.Содержимое = Страница + " " + СокрЛП(СтрокаТекста);
				Вывод = Истина;
			Иначе
				ОбластьСодержания.Параметры.Содержимое = Страница;
				Вывод = Ложь;
			КонецЕсли;
			
			Книга.Вывести(ОбластьСодержания);

			Страница = "";
			
			Книга.ВывестиГоризонтальныйРазделительСтраниц();
			ТекущаяСтраница = ТекущаяСтраница + 1;
			ОбластьШапка.Параметры.Страница		= ТекущаяСтраница;
			Книга.Вывести(ОбластьШапка);

		КонецЕсли;
		
		Пробел		= ?(НоваяСтраница, "", " ");
		Страница 	= Страница + ?(Вывод, "", Пробел + СтрокаТекста);	
		
	КонецЦикла;
	
	Возврат Книга
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьВременныеФайлы(Текст)

	МассивРасширений = Новый Массив;
	МассивРасширений.Добавить("pdf");
	МассивРасширений.Добавить("html");
	
	Для Каждого Код Из МассивРасширений Цикл
		КВФ 		= КаталогВременныхФайлов();
		ПутьКФайлу	= КВФ + Текст.Автор + ", " + Текст.Наименование + "." + нРег(Код);
		Файл 		= Новый Файл(ПутьКФайлу);
		
		Если Файл.Существует() Тогда
			УдалитьФайлы(ПутьКФайлу);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
